from aiogram.types import Message

def check_name(message: Message) -> bool:
    if len(message.text.split()) in [2, 3]:
        return True
    return False




def get_str_numbers():
    res = '\n\n'
    dct = {
        'вилоят штаби': ['652231445', '652231447'],
        'Бухоро шаҳар': ['652230433', '652239883'],
        'Когон шаҳар': '655243307',
        'Когон шаҳар': '655425119',
        'Вобкент тумани': '653321175',
        'Ғиждувон тумани': '655727003',
        'Жондор тумани': '655821792',
        'Когон тумани': '655247536',
        'Қоракўл тумани': '655652038',
        'Қоровулбозор тумани': '653641725',
        'Олот тумани': '653422431',
        'Пешку тумани': '653531145',
        'Ромитан тумани': '655521837',
        'Шофиркон тумани': '655024076'
    }
    for a, b in dct.items():
        if isinstance(b, list):
            res += f'<b>{a}</b>:    {b[0]},   {b[1]}\n'
        else:
            res += f'<b>{a}</b>:     {b}\n'
    return res
            
        